app/Controllers/Admin/FilesMitra.php

SELECT *
FROM `files_mitra`
SELECT *
FROM `files_histori`
---
    public function index()
    {
      if (!$this->session->has('isLogin')) {
            return redirect()->to('/auth/login');
        }

      if ($this->session->get('role') != 1) {
            return redirect()->to('/');
        }

        $FilesModel = new FilesMitraModel();
        $HistoriModel = new HistoriModel();
        $gambarFilesModel = new GambarFilesMitraModel();
        $settings = $this->getSettingsData();
        $userSudahLogin = $this->session->has('isLogin');

        $data['files'] = $FilesModel->findAll();
        $data['files_histori'] = $HistoriModel->findAll();