app/Controllers/Admin/User.php

    public function index()
    {
      if (!$this->session->has('isLogin')) {
            return redirect()->to('/auth/login');
        }

      if ($this->session->get('role') != 1) {
        return redirect()->to('/');
      }

      $settings = $this->getSettingsData();
      $userSudahLogin = $this->session->has('isLogin');

        $userModel = new UserModel();
        $users = $userModel->findAll();
---
SELECT *
FROM `user`