app/Controllers/Admin/Youtube.php

    public function index()
    {
        if (!$this->session->has('isLogin')) {
            return redirect()->to('/auth/login');
        }

        if ($this->session->get('role') != 1) {
            return redirect()->to('/');
        }


        $model = new YoutubeModel();
        $data['youtube'] = $model->findAll();
        $HistoriModel = new HistoriModel();

        $data['files_histori'] = $HistoriModel->findAll();
---
SELECT *
FROM `youtube`
SELECT *
FROM `files_histori`