app/Controllers/BaseController.php

    protected function getSettingsData()
    {
        return $this->settingsWebModel->first();
---
SELECT *
FROM `settings_web`
 LIMIT 1