app/Controllers/FilesMitra.php

    public function index()
    {
        $userSudahLogin = $this->session->has('isLogin');

        $produkModel = new FilesMitraModel();

        $data['produk'] = $produkModel->findAll();
        $produkPopuler['produk'] = $produkModel->where('status', 'Aktif')->findAll();
        $data['gambar_produk'] = $this->gambarFilesModel->findAll();
        $data['files'] = $produkModel->where('status', 'Aktif')->findAll();
---
SELECT *
FROM `files_mitra`
SELECT *
FROM `files_mitra`
WHERE `status` = 'Aktif'

    public function detail($slug)
    {
        $userSudahLogin = $this->session->has('isLogin');

        $produkModel = new FilesMitraModel();
        $gambarProdukModel = new GambarFilesMitraModel();

        $produk = $produkModel->where('slug', $slug)->first();
---
SELECT *
FROM `files_mitra`
WHERE `slug` = 'test-1'
 LIMIT 1