app/Controllers/Home.php

    public function index()
    {
        $userSudahLogin = $this->session->has('isLogin');

        $username = '';

        if ($userSudahLogin) {
            $username = $this->session->get('username');
        }

        $user = $this->userModel->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'Admin'
 LIMIT 1