app/Controllers/Video.php

    public function index()
    {
        $userSudahLogin = $this->session->has('isLogin');

       $model = new YoutubeModel();
        $data['youtube'] = $model->findAll();
---
SELECT *
FROM `youtube`